fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.ВКМ_СведенияОбОтпусках</registerRecords>
  <attributes>
    <name>ГодОтпусков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Отпуска</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпуска

&НаКлиенте
Процедура ОтпускаПриИзменении(Элемент)
	ОтпускаПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура ЗаполнитьСотрудниками(Команда) 
	
	Если Объект.Отпуска.Количество() <> 0  Тогда
		
		Результат = Ждать ВопросАсинх("Список сотрудников будет очищен. Продолжить?", РежимДиалогаВопрос.ДаНет,,,"Вопрос.");	
		
		Если Результат = Неопределено Или Результат = КодВозвратаДиалога.Нет Тогда				
			Возврат;			
		КонецЕсли; 
		
	КонецЕсли;
	
	Объект.Отпуска.Очистить();
	ЗаполнитьСотрудникамиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура АнализГрафика(Команда)
	
	ПараметрыФормы = Новый Структура;	
	ПараметрыФормы.Вставить("Адрес", ПоместитьДанныеВоВременноеХранилище()); 
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы, ЭтотОбъект);   	
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтпускаПриИзмененииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписокОтпусков.Сотрудник КАК Сотрудник,
		|	СписокОтпусков.НомерСтроки КАК НомерСтроки,
		|	РАЗНОСТЬДАТ(СписокОтпусков.ДатаНачала, СписокОтпусков.ДатаОкончания, ДЕНЬ) + 1 КАК ОбщаяПродолжительностьОтпуска
		|ПОМЕСТИТЬ ВТ_СписокОтпусков
		|ИЗ
		|	&СписокОтпусков КАК СписокОтпусков
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СписокОтпусков.Сотрудник КАК Сотрудник,
		|	СУММА(ВТ_СписокОтпусков.ОбщаяПродолжительностьОтпуска) КАК ОбщаяПродолжительностьОтпуска
		|ПОМЕСТИТЬ ВТ_СписокСгруппированный
		|ИЗ
		|	ВТ_СписокОтпусков КАК ВТ_СписокОтпусков
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СписокОтпусков.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СписокОтпусков.НомерСтроки КАК НомерСтроки,
		|	ЕСТЬNULL(ВТ_СписокСгруппированный.ОбщаяПродолжительностьОтпуска, 0) КАК КоличествоДней
		|ИЗ
		|	ВТ_СписокОтпусков КАК ВТ_СписокОтпусков
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СписокСгруппированный КАК ВТ_СписокСгруппированный
		|		ПО ВТ_СписокОтпусков.Сотрудник = ВТ_СписокСгруппированный.Сотрудник";
	
	
	СписокОтпусков = Объект.Отпуска.Выгрузить(,"Сотрудник,НомерСтроки,ДатаНачала,ДатаОкончания" );
	Запрос.УстановитьПараметр("СписокОтпусков",СписокОтпусков);
	
	ТаблицаОтпусков = Запрос.Выполнить().Выбрать();   
	
		
	Пока ТаблицаОтпусков.Следующий() Цикл
		
		Объект.Отпуска[ТаблицаОтпусков.НомерСтроки - 1].КоличествоДней = ТаблицаОтпусков.КоличествоДней;
		
	КонецЦикла;
	
	
КонецПроцедуры


&НаСервере                                       
Функция ПоместитьДанныеВоВременноеХранилище() 
	
	Возврат ПоместитьВоВременноеХранилище(Объект.Отпуска.Выгрузить(), УникальныйИдентификатор);  
	
КонецФункции 

&НаСервере
Процедура ЗаполнитьСотрудникамиНаСервере() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	BKM_Сотрудники.Ссылка КАК Сотрудник
		|ИЗ
		|	Справочник.BKM_Сотрудники КАК BKM_Сотрудники
		|ГДЕ
		|	НЕ BKM_Сотрудники.ПометкаУдаления";
	
	СписокСотрудников = Запрос.Выполнить().Выгрузить();
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(СписокСотрудников,Объект.Отпуска);
	
КонецПроцедуры


#КонецОбласти
